app/controllers/ipaddresses_controller.rb

SELECT * FROM "ipaddresses" WHERE ("ipaddresses"."id" = '--- :iptype
SELECT * FROM "ipaddresses"
---
  def index
    @all_ips = Ipaddress.find(:all)
    #@all_iptypes = Ipaddress.find(:iptype).map(&:iptype).uniq

    if !params[:searchip] && !params[:searchdnsname]
      @ips = @all_ips
    elsif params[:searchip]  && !params[:searchdnsname]
      @ips = Ipaddress.search(params[:searchip],nil)

SELECT * FROM "ipaddresses" WHERE ("ipaddresses"."id" = 1)
---
  def edit
    @ips = Ipaddress.find(params[:id])

SELECT * FROM "ipaddresses" WHERE ("ipaddresses"."id" = 4)
UPDATE "ipaddresses" SET "updated_at" = '2013-08-29 07:54:33', "iptype" = 'used', "subnet" = '10.254.12.0', "address" = '10.254.12.3', "comment" = '', "hostname" = 'sshvib01.internal.draexlmaier.com' WHERE "id" = 2
---
  def update
    @ips = Ipaddress.find(params[:id])
    if @ips.update_attributes(params[:ipaddress])

INSERT INTO "ipaddresses" ("address", "created_at", "subnet", "hostname", "comment", "iptype", "updated_at") VALUES('10.254.12.206', '2013-08-28 12:18:32', '24', 'lnxvib70.internal.draexlmaier.com', 'FEM Node', 'used', '2013-08-28 12:18:32')
---
  def create
    @ips = Ipaddress.new(params[:ipaddress])
    if @ips.save

SELECT * FROM "ipaddresses" WHERE ("ipaddresses"."id" = 1)
---
  def show
    @ips = Ipaddress.find(params[:id])

SELECT * FROM "subnets" WHERE ("subnets"."id" = 1)
---
  def showsub
    @ipsubs = Subnet.find(params[:id])

INSERT INTO "subnets" ("name", "ip_start", "location", "dhcp_start", "gateway", "dhcp_end", "created_at", "mask", "ip_class", "ip_end", "updated_at") VALUES('default linux subnet', '10.254.12.1', 'VIB', '10.254.12.240', '10.254.12.1', '10.254.12.250', '2013-08-28 15:09:44', '24', NULL, '10.254.12.255', '2013-08-28 15:09:44')
---
  def createsub
    @ipsubs = Subnet.new(params[:subnet])
    if @ipsubs.save

SELECT * FROM "subnets" WHERE ("subnets"."id" = 1)
---
  def editsub
    @ipsubs = Subnet.find(params[:id])

SELECT * FROM "subnets" WHERE ("subnets"."id" = 1)
UPDATE "subnets" SET "name" = 'DMZ', "ip_start" = '193.158.111.65', "ip_end" = '193.158.111.126', "gateway" = '193.158.111.69', "mask" = '255.255.255.192', "dhcp_start" = '193.158.111.65', "dhcp_end" = '193.158.111.65', "location" = 'Vilsbiburg', "updated_at" = '2013-11-21 10:12:48' WHERE "id" = 4
---
  def updatesub
    @ipsubs = Subnet.find(params[:id])
    if @ipsubs.update_attributes(params[:subnet])